# GroupBy

In [1]:
import pandas as pd

In [5]:
data=pd.DataFrame({
    
    "Name":['Rehan','Virat','Rohit','Shami','Bumrah','Rehan','Virat','Rohit','Shami','Bumrah','Rehan','Virat','Rohit','Shami','Bumrah'],
    "Scores":[29,34,23,5,31,67,34,24,24,66,46,33,67,34,70],
    "Catches":[2,0,1,2,0,1,0,2,0,1,1,2,3,3,0]
})
data

      Name  Scores  Catches
0    Rehan      29        2
1    Virat      34        0
2    Rohit      23        1
3    Shami       5        2
4   Bumrah      31        0
5    Rehan      67        1
6    Virat      34        0
7    Rohit      24        2
8    Shami      24        0
9   Bumrah      66        1
10   Rehan      46        1
11   Virat      33        2
12   Rohit      67        3
13   Shami      34        3
14  Bumrah      70        0

In [11]:
rehan=data.groupby('Name')
rehan

In [17]:
rehan.get_group('Rehan')
print("\n")
print(rehan.get_group('Virat'))
print("\n")
print(rehan.get_group('Rohit'))
print("\n")
print(rehan.get_group('Shami'))
print("\n")
print(rehan.get_group('Bumrah'))

     Name  Scores  Catches
1   Virat      34        0
6   Virat      34        0
11  Virat      33        2


     Name  Scores  Catches
2   Rohit      23        1
7   Rohit      24        2
12  Rohit      67        3


     Name  Scores  Catches
3   Shami       5        2
8   Shami      24        0
13  Shami      34        3


      Name  Scores  Catches
4   Bumrah      31        0
9   Bumrah      66        1
14  Bumrah      70        0

In [20]:
rehan_data=rehan.get_group('Rehan')
rehan.mean()

           Scores   Catches
Name
Bumrah  55.666667  0.333333
Rehan   47.333333  1.333333
Rohit   38.000000  2.000000
Shami   21.000000  1.666667
Virat   33.666667  0.666667

In [21]:
rehan.max()

        Scores  Catches
Name
Bumrah      70        1
Rehan       67        2
Rohit       67        3
Shami       34        3
Virat       34        2

In [22]:
rehan.min()

        Scores  Catches
Name
Bumrah      31        0
Rehan       29        1
Rohit       23        1
Shami        5        0
Virat       33        0

In [23]:
rehan.std()

           Scores   Catches
Name
Bumrah  21.455380  0.577350
Rehan   19.035055  0.577350
Rohit   25.119713  1.000000
Shami   14.730920  1.527525
Virat    0.577350  1.154701

# Handle Missing Data In Pandas

In [26]:
wheatherData={
    "day":['1/1/2001','2/1/2001','3/1/2001','4/1/2001','5/1/2001'],
    "temperature":[32,null,28,32,NaN],
    "windspeed":[6,5,6,7,4],
    "event":['Rain','sunny',"thunderstrom",NaN,NaN]
}
Dataframe=pd.DataFrame(wheatherData)
DataFrame

NameError: name 'null' is not defined